// Package consts 提供常量定义
package consts

// Mcc 商户类别代码枚举
type Mcc string

const (
	// MCC_0742 兽医服务
	MCC_0742 Mcc = "0742"
	// MCC_0763 农业合作
	MCC_0763 Mcc = "0763"
	// MCC_0780 景观美化及园艺服务
	MCC_0780 Mcc = "0780"
	// MCC_1520 一般承包商－住宅与商业楼
	MCC_1520 Mcc = "1520"
	// MCC_4011 铁路运输
	MCC_4011 Mcc = "4011"
	// MCC_4111 本市和市郊通勤旅客运输（包括轮渡）
	MCC_4111 Mcc = "4111"
	// MCC_4112 铁路客运
	MCC_4112 Mcc = "4112"
	// MCC_4119 救护车服务
	MCC_4119 Mcc = "4119"
	// MCC_4121 出租车服务
	MCC_4121 Mcc = "4121"
	// MCC_4131 公路客运
	MCC_4131 Mcc = "4131"
	// MCC_4214 货物搬运和托运—当地和长途，移动和存储公司，以及当地递送服务
	MCC_4214 Mcc = "4214"
	// MCC_4215 快递服务（空运、地面运输或海运）
	MCC_4215 Mcc = "4215"
	// MCC_4225 公共仓储服务－农产品、冷冻品和家用产品
	MCC_4225 Mcc = "4225"
	// MCC_4411 轮船及巡游航线服务
	MCC_4411 Mcc = "4411"
	// MCC_4457 出租船只
	MCC_4457 Mcc = "4457"
	// MCC_4468 船舶、海运服务提供商
	MCC_4468 Mcc = "4468"
	// MCC_4511 航空公司
	MCC_4511 Mcc = "4511"
	// MCC_4582 机场服务
	MCC_4582 Mcc = "4582"
	// MCC_4722 旅行社
	MCC_4722 Mcc = "4722"
	// MCC_4733 大型景区售票
	MCC_4733 Mcc = "4733"
	// MCC_4784 路桥通行费
	MCC_4784 Mcc = "4784"
	// MCC_4789 未列入其他代码的运输服务
	MCC_4789 Mcc = "4789"
	// MCC_4812 通讯设备和电话销售
	MCC_4812 Mcc = "4812"
	// MCC_4814 电信服务，包括本地和长途电话、信用卡电话、磁卡电话和传真
	MCC_4814 Mcc = "4814"
	// MCC_4816 计算机网络/信息服务
	MCC_4816 Mcc = "4816"
	// MCC_4821 电报服务
	MCC_4821 Mcc = "4821"
	// MCC_4899 有线和其他付费电视服务
	MCC_4899 Mcc = "4899"
	// MCC_4900 公共事业（电力、煤气、自来水、清洁服务）
	MCC_4900 Mcc = "4900"
	// MCC_5094 贵重珠宝、首饰，钟表零售
	MCC_5094 Mcc = "5094"
	// MCC_5211 木材和各类建材卖场
	MCC_5211 Mcc = "5211"
	// MCC_5231 玻璃、油漆涂料、墙纸零售
	MCC_5231 Mcc = "5231"
	// MCC_5251 五金商店
	MCC_5251 Mcc = "5251"
	// MCC_5261 草坪、花园用品商店
	MCC_5261 Mcc = "5261"
	// MCC_5309 免税商店
	MCC_5309 Mcc = "5309"
	// MCC_5310 折扣商店
	MCC_5310 Mcc = "5310"
	// MCC_5311 百货商店
	MCC_5311 Mcc = "5311"
	// MCC_5331 各类杂货店、便利店
	MCC_5331 Mcc = "5331"
	// MCC_5399 其他综合零售
	MCC_5399 Mcc = "5399"
	// MCC_5411 大型仓储式超级市场
	MCC_5411 Mcc = "5411"
	// MCC_5422 各类肉类零售商
	MCC_5422 Mcc = "5422"
	// MCC_5441 糖果及坚果商店
	MCC_5441 Mcc = "5441"
	// MCC_5451 乳制品店、冷饮店
	MCC_5451 Mcc = "5451"
	// MCC_5462 面包房、糕点商店
	MCC_5462 Mcc = "5462"
	// MCC_5499 各类食品店及专门食品零售店
	MCC_5499 Mcc = "5499"
	// MCC_5511 汽车货车经销商－新旧车的销售、服务、维修、零件及出租
	MCC_5511 Mcc = "5511"
	// MCC_5521 汽车货车经销商－专门从事旧车的销售、服务、维修、零件及出租
	MCC_5521 Mcc = "5521"
	// MCC_5532 汽车轮胎经销商
	MCC_5532 Mcc = "5532"
	// MCC_5533 汽车零配件商店
	MCC_5533 Mcc = "5533"
	// MCC_5541 加油站、服务站
	MCC_5541 Mcc = "5541"
	// MCC_5542 自助加油站
	MCC_5542 Mcc = "5542"
	// MCC_5551 船只销售商
	MCC_5551 Mcc = "5551"
	// MCC_5561 旅行拖车、娱乐用车销售商
	MCC_5561 Mcc = "5561"
	// MCC_5571 摩托车商店和经销商
	MCC_5571 Mcc = "5571"
	// MCC_5592 露营、房车销售商
	MCC_5592 Mcc = "5592"
	// MCC_5598 雪车商
	MCC_5598 Mcc = "5598"
	// MCC_5599 汽车、飞行器、农用机车综合经营商
	MCC_5599 Mcc = "5599"
	// MCC_5611 男子和男童服装及用品商店
	MCC_5611 Mcc = "5611"
	// MCC_5621 妇女成衣商店
	MCC_5621 Mcc = "5621"
	// MCC_5631 女性用品商店
	MCC_5631 Mcc = "5631"
	// MCC_5641 婴儿、儿童服装店
	MCC_5641 Mcc = "5641"
	// MCC_5651 家庭服装商店
	MCC_5651 Mcc = "5651"
	// MCC_5655 运动服饰商店
	MCC_5655 Mcc = "5655"
	// MCC_5661 鞋店
	MCC_5661 Mcc = "5661"
	// MCC_5681 皮货店
	MCC_5681 Mcc = "5681"
	// MCC_5722 家用电器商店
	MCC_5722 Mcc = "5722"
	// MCC_5811 包办伙食，宴会承包商
	MCC_5811 Mcc = "5811"
	// MCC_5812 就餐场所和餐馆
	MCC_5812 Mcc = "5812"
	// MCC_5813 饮酒场所（酒吧、酒馆、夜总会、鸡尾酒大厅、迪斯科舞厅）
	MCC_5813 Mcc = "5813"
	// MCC_5932 古玩店——出售、维修及还原
	MCC_5932 Mcc = "5932"
	// MCC_5933 典当、拍卖、信托
	MCC_5933 Mcc = "5933"
	// MCC_5937 古玩复制店
	MCC_5937 Mcc = "5937"
	// MCC_5944 银器店
	MCC_5944 Mcc = "5944"
	// MCC_5950 玻璃器皿和水晶饰品店
	MCC_5950 Mcc = "5950"
	// MCC_5960 直销－保险直销
	MCC_5960 Mcc = "5960"
	// MCC_5970 工艺美术商店
	MCC_5970 Mcc = "5970"
	// MCC_5971 艺术商和画廊
	MCC_5971 Mcc = "5971"
	// MCC_5994 报亭、报摊
	MCC_5994 Mcc = "5994"
	// MCC_5998 其他批发商
	MCC_5998 Mcc = "5998"
	// MCC_6012 金融机构－商品和服务
	MCC_6012 Mcc = "6012"
	// MCC_6300 保险销售、保险业和保险金
	MCC_6300 Mcc = "6300"
	// MCC_7011 住宿服务（旅馆、酒店、汽车旅馆、度假村等）
	MCC_7011 Mcc = "7011"
	// MCC_7012 分时使用的别墅或度假用房
	MCC_7012 Mcc = "7012"
	// MCC_7013 不动产代理——房地产经纪
	MCC_7013 Mcc = "7013"
	// MCC_7032 运动和娱乐露营地
	MCC_7032 Mcc = "7032"
	// MCC_7033 活动房车场及露营场所
	MCC_7033 Mcc = "7033"
	// MCC_7297 按摩店
	MCC_7297 Mcc = "7297"
	// MCC_7298 保健及美容SPA
	MCC_7298 Mcc = "7298"
	// MCC_7523 停车场
	MCC_7523 Mcc = "7523"
	// MCC_7631 手表、钟表和首饰维修店
	MCC_7631 Mcc = "7631"
	// MCC_7829 电影和录像创作、发行
	MCC_7829 Mcc = "7829"
	// MCC_7911 歌舞厅
	MCC_7911 Mcc = "7911"
	// MCC_7922 戏剧制片（不含电影）、演出和票务
	MCC_7922 Mcc = "7922"
	// MCC_7929 未列入其他代码的乐队、文艺表演
	MCC_7929 Mcc = "7929"
	// MCC_7932 台球、撞球场所
	MCC_7932 Mcc = "7932"
	// MCC_7933 保龄球馆
	MCC_7933 Mcc = "7933"
	// MCC_7941 商业体育场馆、职业体育俱乐部、运动场和体育推广公司
	MCC_7941 Mcc = "7941"
	// MCC_7992 公共高尔夫球场
	MCC_7992 Mcc = "7992"
	// MCC_7994 大型游戏机和游戏场所
	MCC_7994 Mcc = "7994"
	// MCC_7996 游乐园、马戏团、嘉年华、占卜
	MCC_7996 Mcc = "7996"
	// MCC_7997 会员俱乐部（体育、娱乐、运动等）、乡村俱乐部以及私人高尔夫课程班
	MCC_7997 Mcc = "7997"
	// MCC_7998 水族馆、海洋馆和海豚馆
	MCC_7998 Mcc = "7998"
	// MCC_7999 未列入其他代码的娱乐服务
	MCC_7999 Mcc = "7999"
	// MCC_8062 公立医院
	MCC_8062 Mcc = "8062"
	// MCC_8211 中小学校（公立）
	MCC_8211 Mcc = "8211"
	// MCC_8220 普通高校（公立）
	MCC_8220 Mcc = "8220"
	// MCC_8398 慈善和社会公益服务组织
	MCC_8398 Mcc = "8398"
	// MCC_8651 政治组织（政府机构）
	MCC_8651 Mcc = "8651"
	// MCC_9211 法庭费用，包括赡养费和子女抚养费
	MCC_9211 Mcc = "9211"
	// MCC_9222 罚款
	MCC_9222 Mcc = "9222"
	// MCC_9223 保释金
	MCC_9223 Mcc = "9223"
	// MCC_9311 纳税
	MCC_9311 Mcc = "9311"
	// MCC_9399 未列入其他代码的政府服务（社会保障服务，国家强制）
	MCC_9399 Mcc = "9399"
	// MCC_9400 使领馆收费
	MCC_9400 Mcc = "9400"
	// MCC_9402 国家邮政服务
	MCC_9402 Mcc = "9402"
	// MCC_3998 中国人民共和国铁道部
	MCC_3998 Mcc = "3998"
	// MCC_BIG_7299 其他个人服务 包括干洗店，育发，植发，保洁、保安、婚庆、殡葬、家政、清洁、保养、门卫服务，出租衣物服务
	MCC_BIG_7299 Mcc = "7299"
	// MCC_BIG_7399 商业服务 无明细分类的其它服务
	MCC_BIG_7399 Mcc = "7399"
	// MCC_BIG_8999 其他专业服务 包括拍卖行、法律服务、会计审计财务服务、公关服务的企业，建筑设计、工程和测量服务等从事专业服务的企业
	MCC_BIG_8999 Mcc = "8999"
)

// Pre 将Mcc枚举转换为字符串
func (m Mcc) Pre() string {
	return string(m)
}
